/**
 * @file   	CMP_control_message_parser.h
 * @author 	Kuroha
 * @version
 * @date 	25 октября 2018 г., 12:47
 * @brief
 */


#ifndef CMP_CONTROL_MESSAGE_PARSER_H_
#define CMP_CONTROL_MESSAGE_PARSER_H_


/*#### |Begin| --> Секция - "Include" ########################################*/
/*==== |Begin| --> Секция - "C libraries" ====================================*/
#include <math.h>
#include <stdio.h>
#include <stdlib.h>
#include <stdint.h>
/*==== |End  | <-- Секция - "C libraries" ====================================*/

/*==== |Begin| --> Секция - "MK peripheral libraries" ========================*/
/*==== |End  | <-- Секция - "MK peripheral libraries" ========================*/

/*==== |Begin| --> Секция - "Extern libraries" ===============================*/
/*==== |End  | <-- Секция - "Extern libraries" ===============================*/
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Определение констант" ###########################*/
/*#### |End  | <-- Секция - "Определение констант" ###########################*/


/*#### |Begin| --> Секция - "Определение типов" ##############################*/
typedef struct
{
	/**
	    * @brief Целевая скорость, которую нужно достичь
	    */
	__PFPT__ targetSpeed;

	/**
	    * @brief Целевой поворот
	    */
	__PFPT__ targetRotation;

	/**
	    * @brief Максимальное значение, которое регулирует скорость и поворот
	    */
	int16_t maxControlValue;

	__PFPT__  discreteInc;

	/**
	    * @brief Нулевое значение (равно половине от максимального значения)
	    */
	int16_t zeroValue;
} cmp_control_data_s;
/*#### |End  | <-- Секция - "Определение типов" ##############################*/


/*#### |Begin| --> Секция - "Определение глобальных переменных" ##############*/
extern size_t CMP_receiveMessage_flag;
/*#### |End  | <-- Секция - "Определение глобальных переменных" ##############*/


/*#### |Begin| --> Секция - "Прототипы глобальных функций" ###################*/
extern void
CMP_init_struct(
	cmp_control_data_s *data);

extern void
CMP_parse_message(
	cmp_control_data_s *data,
	char *controlCmd);
/*#### |End  | <-- Секция - "Прототипы глобальных функций" ###################*/


/*#### |Begin| --> Секция - "Определение макросов" ###########################*/
/*#### |End  | <-- Секция - "Определение макросов" ###########################*/

#endif	/* CMP_CONTROL_MESSAGE_PARSER_H_ */

/*############################################################################*/
/*################################ END OF FILE ###############################*/
/*############################################################################*/
