/**
 * @file   	%<%NAME%>%.%<%EXTENSION%>%
 * @author 	%<%USER%>%
 * @version
 * @date 	%<%DATE%>%, %<%TIME%>%
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "../inc/BLEDS_board_leds.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
static void
BLEDS_Init_GreenLed(
	void);
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
void
BLEDS_Init_AllLeds(
	void)
{
	/* Отключение аналоговых выходов */
	ANSELB = 0x0000;
	ANSELC = 0x0000;
	ANSELD = 0x0000;
	ANSELE = 0x0000;

	/* Вызов функции инициализации зеленого светодиода */
	BLEDS_Init_GreenLed();
}

void
BLEDS_Init_GreenLed(
	void)
{
#if defined		(__PCB_758725_124_03__)
	/* Цифровой выход */
	TRISBbits.TRISB12 = 0;

	/* Включение светодиода */
	LATBbits.LATB12 = 1;

#elif defined	(__PCB_758725_124_02__)
	/* Цифровой выход */

	/* Включение светодиода */

#else
#error 'Please, set pcb version'
#endif
}

void
BLEDS_GreenLed_On(
	void)
{
	/* TODO - Включение светодиода */
}

void
BLEDS_GreenLed_Off(
	void)
{
	/* TODO - Выключение светодиода */
}
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
