/**
 * @file    CMP_control_message_parser.c
 * @author  Kuroha
 * @version
 * @date    25 октября 2018 г., 12:45
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "../inc/CMP_control_message_parser.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
void
CMP_init_struct(
	cmp_control_data_s *data)
{
	data->targetRotation  = (__PFPT__) 0.0;
	data->targetSpeed     = (__PFPT__) 0.0;
	data->maxControlValue = (__PFPT__) 1024.0;
	data->zeroValue = (__PFPT__) (data->maxControlValue / 2.0);
}

void
CMP_parse_message(
	cmp_control_data_s *data,
	char *controlCmd)
{
	if (controlCmd[0] == 'S')
	{
		// Скорость
		int speed;
		sscanf(controlCmd, "S%d\r\n", &speed);
		data->targetSpeed = (__PFPT__) (speed) - data->zeroValue;

	}
	else if (controlCmd[0] == 'D')
	{
		// Направление
		int direction;
		sscanf(controlCmd, "D%d\r\n", &direction);
		data->targetSpeed = (__PFPT__) (direction) - data->zeroValue;
	}
	return;
}
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
