/**
 * @file   	MC32_hardware_counter_32.c
 * @author 	Kuroha
 * @version
 * @date 	26 сентября 2018 г., 17:45
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "../inc/MC32_hardware_counter_32.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
void
MC32_Init_32bitsCntForVirtTimers(
	void)
{
	unsigned int config =
		T6_ON
		& T6_SOURCE_INT
		& T6_IDLE_CON
		& T7_IDLE_STOP
		& T6_PS_1_64
		& T6_GATE_OFF
		& T6_32BIT_MODE_ON;

	OpenTimer67(
		config,
		0xFFFFFFFF);
}
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
