/**
 * @file   	%<%NAME%>%.%<%EXTENSION%>%
 * @author 	%<%USER%>%
 * @version
 * @date 	%<%DATE%>%, %<%TIME%>%
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "../inc/RPA_robot_pitch_angle.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
pcf_all_dta_for_pitch_s RPA_copmFiltDataForPitch_s;
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
float
RPA_GetPitchAngle(
	float *pGyrPitch,
	float accX,
	float accZ)
{
	return (PCF_GetPitchByCompFilt(
				&RPA_copmFiltDataForPitch_s,
				pGyrPitch,
				accX,
				accZ));
}

void
RPA_Init_DataForCalcPitchAngle(
	void)
{
	/* Инициализация констант для вычисления угла наклона*/
	pcf_all_dta_for_pitch_init_struct_s init_s;
	init_s.compFiltCoeff	= 0.9995f;
	init_s.integralCoeff	= 0.00001f;
	init_s.dT				= INTEGRATE_PERIOD_IN_SEC;
	PCF_Init_CompFilt(
		&RPA_copmFiltDataForPitch_s,
		&init_s);
}
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
