/**
 * @file    %<%NAME%>%.%<%EXTENSION%>%
 * @author  %<%USER%>%
 * @version
 * @date    %<%DATE%>%, %<%TIME%>%
 * @brief
 */


/*#### |Begin| --> Секция - "Include" ########################################*/
#include "../inc/TMP_tuning_message_parser.h"
/*#### |End  | <-- Секция - "Include" ########################################*/


/*#### |Begin| --> Секция - "Глобальные переменные" ##########################*/
size_t TMP_receiveTuningMessage_flag;
/*#### |End  | <-- Секция - "Глобальные переменные" ##########################*/


/*#### |Begin| --> Секция - "Локальные переменные" ###########################*/
/*#### |End  | <-- Секция - "Локальные переменные" ###########################*/


/*#### |Begin| --> Секция - "Прототипы локальных функций" ####################*/
/*#### |End  | <-- Секция - "Прототипы локальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание глобальных функций" ####################*/
void
TMP_parse_message(
	char *tuningCmd,
	__REGUL_FPT__ *kP,
	__REGUL_FPT__ *kI,
	__REGUL_FPT__ *kD)
{
	tmp_tuning_message *pMessage_s = (tmp_tuning_message*) tuningCmd;

	uint8_t crc = CRC_XOR_Crc8(
					  (uint8_t*) tuningCmd,
					  sizeof(tmp_tuning_message) - 1);

	if (pMessage_s->crc == crc)
	{
		*kP = pMessage_s->new_kP;
		*kI = pMessage_s->new_kI;
		*kD = pMessage_s->new_kD;
	}

}
/*#### |End  | <-- Секция - "Описание глобальных функций" ####################*/


/*#### |Begin| --> Секция - "Описание локальных функций" #####################*/
/*#### |End  | <-- Секция - "Описание локальных функций" #####################*/


/*############################################################################*/
/*############################ END OF FILE  ##################################*/
/*############################################################################*/
